GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
/*
   这个回调主要是M66的链路关断时的通知，socket不是一个完整的线程
 */
void cb_socket_close( uint8_t cid )
{
	if( cid == 1 )
	{
		connect_state.server_state = CONNECT_CLOSE;
		rt_kprintf( "\n%d>linkno %d close", rt_tick_get( ), cid );
	}

	if( cid == 2 )
	{
		connect_state.auth_state = CONNECT_CLOSE;
	}

	if( cid == 5 ) /*Deactivate M2M */
	{
		gsmstate( GSM_POWEROFF );
	}
}

/*
   接收处理
   分析jt808格式的数据
   <linkno><长度2byte><标识0x7e><消息头><消息体><校验码><标识0x7e>

   20130625 会有粘包的情况

 */
void jt808_rx_proc( uint8_t * pinfo )
{
	uint8_t		* psrc, *pdst, *pdata;
	uint16_t	total_len;
	uint8_t		linkno;
	uint16_t	i, id;
	uint8_t		flag_find	= 0;
	uint8_t		fcs			= 0;
	uint16_t	count;
	uint8_t		fstuff = 0;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                /*是否字节填充*/

	linkno		= pinfo [0];
	total_len	= ( pinfo [1] << 8 ) | pinfo [2];

	psrc	= pinfo + 3;
	pdst	= pinfo + 3;

	count = 0;

/*处理粘包*/
	while( total_len )
	{
		if( *psrc == 0x7e )         /*包头包尾标志*/
		{
			if( count )             /*有数据*/
			{
				if( fcs == 0 )      /*数据正确*/
				{
					*psrc	= 0;    /*20120711 置为字符串结束标志*/
					id		= ( ( *pdata ) << 8 ) | *( pdata + 1 );
					for( i = 0; i < sizeof( handle_rx_msg ) / sizeof( HANDLE_JT808_RX_MSG ); i++ )
					{
						if( id == handle_rx_msg [i].id )
						{
							handle_rx_msg [i].func( linkno, pdata );
							flag_find = 1;
						}
					}
					if( !flag_find )
					{
						handle_rx_default( linkno, pdata );
						flag_find = 0;
					}
				}else
				{
					rt_kprintf( "\ncount=%d,fcs err=%d", count, fcs );
				}
			}
			fcs		= 0;
			pdata	= psrc;         /*指向数据头,0x7E的位置*/
			pdst	= psrc;
		}else if( *psrc == 0x7d )   /*是转义字符等待处理下一个*/
		{
			fstuff = 0x7c;
		} else
		{
			*pdst	= *psrc + fstuff;
			fstuff	= 0;
			count++;
			fcs ^= *pdst;
			pdst++;
		}
		psrc++;
		total_len--;
	}
}

/*
   处理每个要发送信息的状态
   现在允许并行处理吗?

   2013.06.08增加多包发送处理
 */
#if 0
static MsgListRet jt808_tx_proc( MsgListNode * node )
{
	MsgListNode			* pnode		= ( MsgListNode* )node;
	JT808_TX_NODEDATA	* pnodedata = ( JT808_TX_NODEDATA* )( pnode->data );
	int					i;
	rt_err_t			ret;

	if( node == RT_NULL )
	{
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == IDLE )                      /*空闲，发送信息或超时后没有数据*/
	{
		if( pnodedata->retry >= jt808_param.id_0x0003 ) /*超过了最大重传次数*/                                                                     /*已经达到重试次数*/
		{
			/*表示发送失败*/
			pnodedata->cb_tx_timeout( pnodedata );      /*调用发送失败处理函数*/
			return MSGLIST_RET_DELETE_NODE;
		}
		/*要判断是不是出于GSM_TCPIP状态,当前socket是否可用*/
		if( gsmstate( GSM_STATE_GET ) != GSM_TCPIP )
		{
			return MSGLIST_RET_OK;
		}
		if( connect_state.server_state != CONNECTED )
		{
			return MSGLIST_RET_OK;
		}

		ret = socket_write( pnodedata->linkno, pnodedata->tag_data, pnodedata->msg_len );
		if( ret == RT_EOK ) /*发送成功等待中心应答中*/
		{
			pnodedata->tick = rt_tick_get( );
			pnodedata->retry++;
			pnodedata->timeout	= pnodedata->retry * jt808_param.id_0x0002 * RT_TICK_PER_SECOND;
			pnodedata->state	= WAIT_ACK;
			rt_kprintf( "send retry=%d,timeout=%d\r\n", pnodedata->retry, pnodedata->timeout * 10 );
		}else /*发送数据没有等到模块返回的OK，立刻重发，还是等一段时间再发*/
		{
			pnodedata->retry++;         /*置位再次发送*/
			total_send_error++;
			rt_kprintf( "total_send_error=%d\r\n", total_send_error );
		}
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == WAIT_ACK )  /*检查中心应答是否超时*/
	{
		if( rt_tick_get( ) - pnodedata->tick > pnodedata->timeout )
		{
			pnodedata->state = IDLE;
		}
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == ACK_OK )
	{
		return MSGLIST_RET_DELETE_NODE;
	}

	return MSGLIST_RET_OK;
}

#endif

/*发送控制*/
static JT808_MSG_STATE jt808_tx_proc( MsgListNode * node )
{
	MsgListNode			* pnode		= ( MsgListNode* )node;
	JT808_TX_NODEDATA	* pnodedata = ( JT808_TX_NODEDATA* )( pnode->data );
	rt_err_t			ret;

	if( node == RT_NULL )
	{
		return IDLE;
	}

	if( pnodedata->state == IDLE ) /*空闲，发送信息或超时后没有数据*/
	{
#if 1
		/*要判断是不是出于GSM_TCPIP状态,当前socket是否可用*/
		if( gsmstate( GSM_STATE_GET ) != GSM_TCPIP )
		{
			return IDLE;
		}
		if( connect_state.server_state != CONNECTED )
		{
			return IDLE;
		}
		rt_kprintf( "\n%d socket>", rt_tick_get( ) );
		ret = socket_write( pnodedata->linkno, pnodedata->tag_data, pnodedata->msg_len );
#else
		do
		{
			uint8_t* pdata = pnodedata->tag_data;
			rt_kprintf( "\r\n>DUMP BEGIN\r\n" );
			for( i = 0; i < pnodedata->msg_len; i++ )
			{
				if( ( i % 16 ) == 0 )
				{
					rt_kprintf( "\r\n" );
				}
				rt_kprintf( "%02x ", *pdata++ );
			}
			rt_kprintf( "\r\n>DUMP END\r\n" );
		}
		while( 0 );
		ret = RT_EOK;
#endif
		if( ret != RT_EOK )             /*gsm<ERROR:41 发送数据没有等到模块返回的OK，立刻重发，还是等一段时间再发*/
		{
			total_send_error++;
			rt_kprintf( "\ntotal_send_error=%d", total_send_error );
			if( total_send_error > 3 )  /*m66 发送失败,如何处理*/
			{
				total_send_error = 0;
				connect_state.server_state =CONNECT_IDLE ;
				connect_state.auth_state =CONNECT_IDLE ;
				gsmstate( GSM_POWEROFF );
			}
			
