GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
		}
		tick_server_heartbeat = rt_tick_get( );

		if( pnodedata->type == SINGLE_ACK )                                                             /*应答信息，只发一遍，发完删除即可*/
		{
			return WAIT_DELETE;
		}

		pnodedata->timeout_tick = rt_tick_get( ) + ( pnodedata->retry + 1 ) * pnodedata->timeout - 30;  /*减30是为了修正*/
		pnodedata->state		= WAIT_ACK;
		rt_kprintf( "\n%d>send id=%04x (%d/%d) timeout=%d",
		            rt_tick_get( ),
		            pnodedata->head_id,
		            pnodedata->retry,
		            pnodedata->max_retry,
		            ( pnodedata->retry + 1 ) * pnodedata->timeout * 10 );
		return IDLE;
	}

	if( pnodedata->state == WAIT_ACK )                                                   /*检查中心应答是否超时*/
	{
		if( rt_tick_get( ) >= pnodedata->timeout_tick )
		{
			pnodedata->retry++;
			if( pnodedata->retry >= pnodedata->max_retry )
			{
				return pnodedata->cb_tx_timeout( pnodedata );
			}else
			{
				pnodedata->state = IDLE;
				return IDLE; /*等待下次发送*/
			}
		}
		return WAIT_ACK;
	}

	if( pnodedata->state == ACK_OK )
	{
		return WAIT_DELETE;
	}
	return pnodedata->state;
}

/*
   808连接处理
   是以gsm状态迁移的,如果已层次状态机的模型，
   是不是从顶到底的状态处理会更好些。

   jt808_state   注册，鉴权 ，正常上报，停报
   socket_state
   gsm_state

 */
static void jt808_socket_proc( void )
{
	T_GSM_STATE state;
	uint8_t		buf[64];


/*
   检查是否允许gsm工作
   中间的时候关闭连接
 */
	if( connect_state.disable_connect )
	{
		return;
	}

/*检查GSM状态*/
	state = gsmstate( GSM_STATE_GET );
	if( state == GSM_IDLE )
	{
		gsmstate( GSM_POWERON );                /*开机登网*/
		return;
	}
	return;		/*临时测试不登网*/
/*控制登网*/
	if( state == GSM_AT )                       /*这里要判断用那个apn user psw 登网*/
	{
		if( connect_state.server_index % 2 )    /*用备用服务器*/
		{
			ctl_gprs( jt808_param.id_0x0014, \
			          jt808_param.id_0x0015, \
			          jt808_param.id_0x0016, \
			          1 );
		}else /*用主服务器*/
		{
			ctl_gprs( jt808_param.id_0x0010, \
			          jt808_param.id_0x0011, \
			          jt808_param.id_0x0012, \
			          1 );
		}
		return;
	}
/*控制建立连接*/
	if( state == GSM_TCPIP )                                /*已经在线了*/
	{
		if( connect_state.server_state == CONNECT_IDLE )
		{
			if( connect_state.server_index % 2 )            /*连备用服务器*/
			{
				ctl_socket( 1, 't', jt808_param.id_0x0017, jt808_param.id_0x0018, 1 );
			}else /*连主服务器*/
			{
				ctl_socket( 1, 't', jt808_param.id_0x0013, jt808_param.id_0x0018, 1 );
			}
			connect_state.server_state = CONNECT_PEER;      /*此时gsm_state处于 GSM_SOCKET_PROC，连完后返回 GSM_TCPIP*/
			return;
		}

		if( connect_state.server_state == CONNECT_PEER )    /*正在连接到服务器*/
		{
			if( socketstate( SOCKET_STATE ) == SOCKET_READY )
			{
				connect_state.server_state = CONNECTED;
			}else /*没有连接成功,切换服务器*/
			{
				connect_state.server_index++;
				connect_state.server_state = CONNECT_IDLE;
			}
		}

		if( connect_state.server_state == CONNECTED )                   /*链路维护心跳包*/
		{
			/*判断当前链接是否异常*/
			if( socketstate( SOCKET_STATE ) == CONNECT_CLOSE )          /*链接被挂断，是主动挂断还是网络原因*/
			{
				connect_state.server_state	= CONNECT_IDLE;             /*还是在cb_socket_close中判断*/
				jt808_state					= AUTH;                     /*重新连接要重新鉴权*/
				return;
			}

			switch( jt808_state )
			{
				case REGISTER:
					buf[0]	= jt808_param.id_0x0081 >> 8;               /*省域*/
					buf[1]	= jt808_param.id_0x0081 & 0xff;
					buf[2]	= jt808_param.id_0x0082 >> 8;               /*市域*/
					buf[3]	= jt808_param.id_0x0082 & 0xff;
					memcpy( buf + 4, jt808_param.id_0xF000, 5 );        /*制造商ID*/
					memcpy( buf + 9, jt808_param.id_0xF001, 20 );       /*终端型号*/
					memcpy( buf + 29, jt808_param.id_0xF002, 7 );       /*终端ID*/
					buf[36] = jt808_param.id_0xF004;
					strcpy( (char*)buf + 37, jt808_param.id_0xF005 );   /*车辆表示或VIN*/
					jt808_add_tx( 1,
					              SINGLE_FIRST,
					              0x0100,
					              -1, RT_NULL, RT_NULL,
					              37 + strlen( jt808_param.id_0xF005 ), buf, RT_NULL );
					jt808_state = WAIT;
					break;
				case AUTH:
					jt808_add_tx( 1,
					              SINGLE_FIRST,
					              0x0102,
					              -1, RT_NULL, RT_NULL,
					              strlen( jt808_param.id_0xF003 ),
					              (uint8_t*)( jt808_param.id_0xF003 ), RT_NULL );
					jt808_state = WAIT;
					break;
				case REPORT:
					if( tick_server_heartbeat )
					{
						/*要发送心跳包*/
						if( ( rt_tick_get( ) - tick_server_heartbeat ) >= ( jt808_param.id_0x0001 * RT_TICK_PER_SECOND ) )
						{
							jt808_tx_ack( 0x0002, buf, 0 );
							tick_server_heartbeat = rt_tick_get( ); /*首次用保留当前时刻*/
						}
					}else
					{
						tick_server_heartbeat = rt_tick_get( ); /*首次用保留当前时刻*/
					}
					break;
			}

			return;                                             /*直接返回，不连ICCARD*/
		}

		if( connect_state.server_state == CONNECT_CLOSE )       /*链接关闭，区分主动还是被动关闭*/
		{
			connect_state.server_state	= CONNECT_IDLE;         /*重新连接*/
			jt808_state					= AUTH;                 /*重新连接要重新鉴权*/
		}

		/*连接IC卡服务器*/

		if( connect_state.auth_state == CONNECT_IDLE )          /*没有连接*/
		{
			if( connect_state.auth_index % 2 )                  /*连备用服务器*/
			{
				ctl_socket( 2, 't', jt808_param.id_0x001A, jt808_param.id_0x001B, 1 );
			}else /*连主服务器*/
			{
				ctl_socket( 2, 't', jt808_param.id_0x001D, jt808_param.id_0x001B, 1 );
			}
			connect_state.auth_state = CONNECT_PEER;
			return;
		}

		if( connect_state.auth_state == CONNECT_PEER ) /*正在连接到服务器*/
		{
			if( socketstate( SOCKET_STATE ) == SOCKET_READY )
			{
				connect_state.auth_state = CONNECTED;
			}else /*没有连接成功,切换服务器*/
			{
				//connect_state.auth_index++;
				//connect_state.auth_state=CONNECT_IDLE;
				//if(connect_state.auth_index>6)
				//{
				//}
			}
		}
	}
}

/*
   连接状态维护
   jt808协议处理

 */
ALIGN( RT_ALIGN_SIZE )
static char thread_jt808_stack [2048];
struct rt_thread thread_jt808;

/***/
static void rt_thread_entry_jt808( void * parameter )
{
	rt_err_t			ret;
	uint8_t				* pstr;

	MsgListNode			* iter;
	JT808_TX_NODEDATA	* pnodedata;

	GPIO_SetBits( GPIOD, GPIO_Pin_9 );      /*关功放*/
	jt808_misc_init( );
	jt808_gps_init( );

	list_jt808_tx	= msglist_create( );
	list_jt808_rx	= msglist_create( );
/*初始化其他信息*/
	if( strlen( jt808_param.id_0xF003 ) )   /*是否已有鉴权码*/
	{
		jt808_state = AUTH;
	}

	while( 1 )
	{
/*接收gprs信息*/
		ret = rt_mb_recv( &mb_gprsrx, ( rt_uint32_t* )&pstr, 5 );
		if( ret == RT_EOK )
		{
			jt808_rx_proc( pstr );
			rt_free( pstr );
		}

		jt808_socket_proc( );   /*jt808 socket处理*/



/*短信处理*/
		//SMS_Process( );

/*发送信息逐条处理*/
		iter = list_jt808_tx->first;

