GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
		if( jt808_tx_proc( iter ) == WAIT_DELETE )  /*删除该节点*/
		{
			pnodedata = ( JT808_TX_NODEDATA* )( iter->data );
			rt_kprintf( "\n%d>free node(%04x) %p", rt_tick_get( ), pnodedata->head_id, pnodedata );
			rt_free( pnodedata->user_para );
			rt_free( pnodedata );                   /*删除节点数据*/
			list_jt808_tx->first = iter->next;      /*指向下一个*/
			rt_free( iter );
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}

	msglist_destroy( list_jt808_tx );
}

#define BKSRAM

#ifdef BKSRAM

/**/
void bkpsram_init( void )
{
	/* Enable the PWR APB1 Clock Interface */
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_PWR, ENABLE );

	/* Allow access to BKP Domain */
	PWR_BackupAccessCmd( ENABLE );

	/* Enable BKPSRAM Clock */
	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_BKPSRAM, ENABLE );

	/* Enable the Backup SRAM low power Regulator to retain it's content in VBAT mode */
	PWR_BackupRegulatorCmd( ENABLE );

	/* Wait until the Backup SRAM low power Regulator is ready */
	while( PWR_GetFlagStatus( PWR_FLAG_BRR ) == RESET )
	{
	}
	//rt_kprintf("\r\n BkpSram_init OK!");
}

/*********************************************************************************
  *函数名称:u8 BkpSram_write(u32 addr,u8 *data, u16 len)
  *功能描述:backup sram 数据写入
  *输	入:	addr	:写入的地址
   data	:写入的数据指针
   len		:写入的长度
  *输	出:	none
  *返 回 值:u8	:	0:表示操作失败，	1:表示操作成功
  *作	者:白养民
  *创建日期:2013-06-18
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 bkpsram_write( u32 addr, u8 * data, u16 len )
{
	u32 i;
	//addr &= 0xFFFC;
	//*(__IO uint32_t *) (BKPSRAM_BASE + addr) = data;
	for( i = 0; i < len; i++ )
	{
		if( addr < 0x1000 )
		{
			*(__IO uint8_t*)( BKPSRAM_BASE + addr ) = *data++;
		}else
		{
			return 0;
		}
		++addr;
	}
	return 1;
}

/*********************************************************************************
  *函数名称:u16 bkpSram_read(u32 addr,u8 *data, u16 len)
  *功能描述:backup sram 数据读取
  *输	入:	addr	:读取的地址
   data	:读取的数据指针
   len		:读取的长度
  *输	出:	none
  *返 回 值:u16	:表示实际读取的长度
  *作	者:白养民
  *创建日期:2013-06-18
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 bkpsram_read( u32 addr, u8 * data, u16 len )
{
	u32 i;
	//addr &= 0xFFFC;
	//data = *(__IO uint32_t *) (BKPSRAM_BASE + addr);
	for( i = 0; i < len; i++ )
	{
		if( addr < 0x1000 )
		{
			*data++ = *(__IO uint8_t*)( BKPSRAM_BASE + addr );
		}else
		{
			break;
		}
		++addr;
	}
	return i;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void bkpsram_wr( u32 addr, char *psrc )
{
	char pstr[128];
	memset( pstr, 0, sizeof( pstr ) );
	memcpy( pstr, psrc, strlen( psrc ) );
	bkpsram_write( addr, (uint8_t*)pstr, strlen( pstr ) + 1 );
}

FINSH_FUNCTION_EXPORT( bkpsram_wr, write from backup sram );

/**/
void bkpsram_rd( u32 addr )
{
	uint8_t pstr[128];
	bkpsram_read( addr, pstr, sizeof( pstr ) );
	rt_kprintf( "\nstr=%s", pstr );
}

FINSH_FUNCTION_EXPORT( bkpsram_rd, read from backup sram );

#endif

/*jt808处理线程初始化*/
void jt808_init( void )
{
	/*读取参数，并配置,这个时候应该没有操作flash的*/
	param_load( );

#ifdef BKSRAM
	bkpsram_init( );
#endif
	vdr_init( );

	rt_mb_init( &mb_gprsrx, "mb_gprs", &mb_gprsrx_pool, MB_GPRSDATA_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );


	rt_thread_init( &thread_jt808,
	                "jt808",
	                rt_thread_entry_jt808,
	                RT_NULL,
	                &thread_jt808_stack [0],
	                sizeof( thread_jt808_stack ), 10, 5 );
	rt_thread_startup( &thread_jt808 );
}

/*gprs接收处理,收到数据要尽快处理*/
rt_err_t gprs_rx( uint8_t linkno, uint8_t * pinfo, uint16_t length )
{
	uint8_t * pmsg;
	pmsg = rt_malloc( length + 3 );                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               /*包含长度信息*/
	if( pmsg != RT_NULL )
	{
		pmsg [0]	= linkno;
		pmsg [1]	= length >> 8;
		pmsg [2]	= length & 0xff;
		memcpy( pmsg + 3, pinfo, length );
		rt_mb_send( &mb_gprsrx, ( rt_uint32_t )pmsg );
		return 0;
	}
	return 1;
}




/*
   重启设备
   填充重启原因
 */
void reset( unsigned int reason )
{
/*没有发送的数据要保存*/

/*关闭连接*/

/*日志记录时刻重启原因*/

	rt_kprintf( "\n%08d reset>reason=%08x", rt_tick_get( ), reason );
/*执行重启*/
	rt_thread_delay( RT_TICK_PER_SECOND * 5 );
	NVIC_SystemReset( );
}

FINSH_FUNCTION_EXPORT( reset, restart device );

/*恢复出厂设置*/
void factory( void )
{
	uint16_t	i;
	uint32_t	addr = 51 * 4096;
	rt_enter_critical( );
	for( i = 51; i < 1024; i++ )
	{
		sst25_erase_4k( addr );
		addr += 4096;
	}
	NVIC_SystemReset( );
}

FINSH_FUNCTION_EXPORT( factory, reset to factory );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void list_node( void )
{
	MsgListNode			* iter;
	JT808_TX_NODEDATA	* pnodedata;

	iter = list_jt808_tx->first;
	while( iter != NULL )
	{
		pnodedata = ( JT808_TX_NODEDATA* )( iter->data );
		rt_kprintf( "\nid=%04x\tseq=%04x len=%d", pnodedata->head_id, pnodedata->head_sn, pnodedata->msg_len );
		iter = iter->next;
	}
	return;
}

FINSH_FUNCTION_EXPORT( list_node, list node );

/************************************** The End Of File **************************************/

